ledgers-middleware/ledgers-middleware-service-impl/src/test/resources/de/adorsys/ledgers/middleware/impl/converter/PaymentPeriodic.yml

paymentId: myPaymentId
batchBookingPreferred:
requestedExecutionDate: 2018-12-12
requestedExecutionTime: 12:00:00
paymentType: PERIODIC
paymentProduct: "sepa-credit-transfers"
startDate: 2018-12-12
endDate: 2018-12-28
executionRule: everyday
frequency: DAILY
dayOfExecution: 1
debtorAccount:
  {
    iban: DE91100000000123456789,
    bban: bban,
    pan: pan,
    maskedPan: maskedPan,
    msisdn: msisdn,
    currency: EUR
  }
transactionStatus: RCVD
targets:
  - {
      paymentId: myPaymentId,
      endToEndIdentification: 123456789,
      instructedAmount:
        {
          currency: EUR,
          amount: 100
        },
      creditorAccount:
        {
          iban: DE91100000000123456789,
          bban: bban,
          pan: pan,
          maskedPan: maskedPan,
          msisdn: msisdn,
          currency: EUR
         },
      creditorAgent: agent,
      creditorName: Rozetka.ua,
      creditorAddress:
      {
          street: SomeStreet,
          buildingNumber: 666,
          city: Kiev,
          postalCode: 04210,
          country: Ukraine
      },
      remittanceInformationUnstructured: remittance,
      payment:
  }
